src/com/landray/kmss/tic/soap/connector/util/fileTemplate/EAS_template.xml

<?xml version="1.0" encoding="utf-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<soapenv:Header>
		<ns1:SessionId
			xmlns:ns1="$address$"
			xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"
			soapenv:actor="http://schemas.xmlsoap.org/soap/actor/next"
			soapenv:mustUnderstand="0" xsi:type="soapenc:string">$sessionId$</ns1:SessionId>
	</soapenv:Header>
	<soapenv:Body>
		<ns2:importVoucher xmlns:ns2="http://webservice.app.gl.fi.eas.kingdee.com"
			soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
			<col xmlns:ns3="urn:client.wsvoucher" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"
				soapenc:arrayType="ns3:WSWSVoucher[1]" xsi:type="soapenc:Array">
				<col>
					<cashAsstActType5 xsi:type="xsd:string" xsi:nil="true" />
					<oppAccountSeq xsi:type="xsd:int" xsi:nil="true" />
					<cashAsstActType4 xsi:type="xsd:string" xsi:nil="true" />
					<cashAsstActType3 xsi:type="xsd:string" xsi:nil="true" />
					<cashflowAmountOriginal xsi:type="xsd:double"
						xsi:nil="true" />
					<cashAsstActType2 xsi:type="xsd:string" xsi:nil="true" />
					<bizDate xsi:type="xsd:string" xsi:nil="true" />
					<cashAsstActType1 xsi:type="xsd:string" xsi:nil="true" />
					<cashflowAmountLocal xsi:type="xsd:double"
						xsi:nil="true" />
					<bizNumber xsi:type="xsd:string" xsi:nil="true" />
					<companyNumber xsi:type="xsd:string" xsi:nil="true" />
					<voucherType xsi:type="xsd:string" xsi:nil="true" />
					<attaches xsi:type="xsd:int" xsi:nil="true" />
					<tempNumber xsi:type="xsd:string" xsi:nil="true" />
					<cashAsstActType8 xsi:type="xsd:string" xsi:nil="true" />
					<cashAsstActType6 xsi:type="xsd:string" xsi:nil="true" />
					<cashAsstActType7 xsi:type="xsd:string" xsi:nil="true" />
					<cussent xsi:type="xsd:int" xsi:nil="true" />
					<entrySeq xsi:type="xsd:int" xsi:nil="true" />
					<currencyNumber xsi:type="xsd:string" xsi:nil="true" />
					<supplyCoef xsi:type="xsd:double" xsi:nil="true" />
					<asstActType5 xsi:type="xsd:string" xsi:nil="true" />
					<asstSeq xsi:type="xsd:int" xsi:nil="true" />
					<asstActType6 xsi:type="xsd:string" xsi:nil="true" />
					<asstActType7 xsi:type="xsd:string" xsi:nil="true" />
					<asstActType8 xsi:type="xsd:string" xsi:nil="true" />
					<asstActType1 xsi:type="xsd:string" xsi:nil="true" />
					<bookedDate xsi:type="xsd:string" xsi:nil="true" />
					<asstActType2 xsi:type="xsd:string" xsi:nil="true" />
					<asstActType3 xsi:type="xsd:string" xsi:nil="true" />
					<asstActType4 xsi:type="xsd:string" xsi:nil="true" />
					<assistBizDate xsi:type="xsd:string" xsi:nil="true" />
					<creator xsi:type="xsd:string" xsi:nil="true" />
					<supplyItem xsi:type="xsd:string" xsi:nil="true" />
					<icketNumber xsi:type="xsd:string" xsi:nil="true" />
					<cashflowAmountRpt xsi:type="xsd:double" xsi:nil="true" />
					<itemFlag xsi:type="xsd:int" xsi:nil="true" />
					<entryDC xsi:type="xsd:int" xsi:nil="true" />
					<cashAsstActNumber2 xsi:type="xsd:string"
						xsi:nil="true" />
					<cashAsstActNumber1 xsi:type="xsd:string"
						xsi:nil="true" />
					<voucherNumber xsi:type="xsd:string" xsi:nil="true" />
					<cashAsstActNumber4 xsi:type="xsd:string"
						xsi:nil="true" />
					<cashAsstActNumber3 xsi:type="xsd:string"
						xsi:nil="true" />
					<creditAmount xsi:type="xsd:double" xsi:nil="true" />
					<poster xsi:type="xsd:string" xsi:nil="true" />
					<cashAsstActName5 xsi:type="xsd:string" xsi:nil="true" />
					<asstActNumber1 xsi:type="xsd:string" xsi:nil="true" />
					<cashAsstActName6 xsi:type="xsd:string" xsi:nil="true" />
					<asstActNumber2 xsi:type="xsd:string" xsi:nil="true" />
					<cashAsstActName3 xsi:type="xsd:string" xsi:nil="true" />
					<cashAsstActName4 xsi:type="xsd:string" xsi:nil="true" />
					<asstActNumber3 xsi:type="xsd:string" xsi:nil="true" />
					<cashAsstActName1 xsi:type="xsd:string" xsi:nil="true" />
					<asstActNumber4 xsi:type="xsd:string" xsi:nil="true" />
					<price xsi:type="xsd:double" xsi:nil="true" />
					<periodYear xsi:type="xsd:int" xsi:nil="true" />
					<asstActNumber5 xsi:type="xsd:string" xsi:nil="true" />
					<cashAsstActName2 xsi:type="xsd:string" xsi:nil="true" />
					<asstActNumber6 xsi:type="xsd:string" xsi:nil="true" />
					<asstActNumber7 xsi:type="xsd:string" xsi:nil="true" />
					<measurement xsi:type="xsd:string" xsi:nil="true" />
					<localRate xsi:type="xsd:double" xsi:nil="true" />
					<asstActNumber8 xsi:type="xsd:string" xsi:nil="true" />
					<periodNumber xsi:type="xsd:int" xsi:nil="true" />
					<invoiceNumber xsi:type="xsd:string" xsi:nil="true" />
					<qty xsi:type="xsd:double" xsi:nil="true" />
					<settlementType xsi:type="xsd:string" xsi:nil="true" />
					<primaryItem xsi:type="xsd:string" xsi:nil="true" />
					<assistEndDate xsi:type="xsd:string" xsi:nil="true" />
					<primaryCoef xsi:type="xsd:double" xsi:nil="true" />
					<voucherAbstract xsi:type="xsd:string" xsi:nil="true" />
					<settlementNumber xsi:type="xsd:string" xsi:nil="true" />
					<debitAmount xsi:type="xsd:double" xsi:nil="true" />
					<description xsi:type="xsd:string" xsi:nil="true" />
					<accountNumber xsi:type="xsd:string" xsi:nil="true" />
					<originalAmount xsi:type="xsd:double" xsi:nil="true" />
					<asstActName1 xsi:type="xsd:string" xsi:nil="true" />
					<type xsi:type="xsd:string" xsi:nil="true" />
					<isCheck xsi:type="xsd:boolean" xsi:nil="true" />
					<cashAsstActName8 xsi:type="xsd:string" xsi:nil="true" />
					<cashAsstActName7 xsi:type="xsd:string" xsi:nil="true" />
					<cashAsstActNumber7 xsi:type="xsd:string"
						xsi:nil="true" />
					<customerNumber xsi:type="xsd:string" xsi:nil="true" />
					<asstActName7 xsi:type="xsd:string" xsi:nil="true" />
					<cashAsstActNumber8 xsi:type="xsd:string"
						xsi:nil="true" />
					<asstActName6 xsi:type="xsd:string" xsi:nil="true" />
					<cashAsstActNumber5 xsi:type="xsd:string"
						xsi:nil="true" />
					<cashAsstActNumber6 xsi:type="xsd:string"
						xsi:nil="true" />
					<asstActName8 xsi:type="xsd:string" xsi:nil="true" />
					<auditor xsi:type="xsd:string" xsi:nil="true" />
					<asstActName3 xsi:type="xsd:string" xsi:nil="true" />
					<asstActName2 xsi:type="xsd:string" xsi:nil="true" />
					<asstActName5 xsi:type="xsd:string" xsi:nil="true" />
					<asstActName4 xsi:type="xsd:string" xsi:nil="true" />
				</col>
			</col>
			<isSubmit xsi:nil="true" />
			<isVerify xsi:nil="true" />
			<isCashflow xsi:nil="true" />
		</ns2:importVoucher>
	</soapenv:Body>
</soapenv:Envelope>